Repository: guh0613/ruri
Catalog: Sources/RuriLocalization/Resources/Progress.xcstrings
Source language: zh_hans
Languages: en

# AppActivityItem.preparing
source: 准备中
en: Preparing

# AppAppModel.taskCompleted
source: 已完成
en: Completed

# AppAppModelContent.downloadManifest
source: 下载整合包清单
en: Downloading modpack manifest

# AppAppModelLaunching.checkingAccountAndJava
source: 正在检查账号和 Java
en: Checking account and Java

# AppAppModelLaunching.preparingAuthComponent
source: 正在准备第三方认证组件
en: Preparing third-party authentication

# AppAppModelLaunching.preparingJava
source: 正在准备所需的 Java %1$@
en: Preparing Java %1$@

# AppWorldManagerView.processingWorldFiles
source: 处理存档文件
en: Processing world files

# CoreCompleteInstancePack.compressingCompleteCopy
source: 正在压缩完整副本
en: Compressing complete copy

# CoreCompleteInstancePack.copyingInstallationFiles
source: 正在复制安装文件
en: Copying installation files

# CoreCompleteInstancePack.readingCompleteInstallation
source: 正在读取完整安装文件
en: Reading installation files

# CoreContentBatchUpdater.applyingContentUpdates
source: 正在安装 %1$lld 项资源更新
en: Applying %1$lld content updates

# CoreCurseForge.downloadFile
source: 下载 %1$@
en: Downloading %1$@

# CoreForgeInstaller.downloadInstaller
source: 下载 %1$@ 安装程序
en: Downloading %1$@ installer

# CoreForgeInstaller.prepareDependencies
source: 准备加载器依赖
en: Preparing loader dependencies

# CoreForgeInstaller.runInstaller
source: 运行 %1$@ 安装程序
en: Running %1$@ installer

# CoreForgeInstaller.verifyGeneratedFiles
source: 校验加载器生成的文件
en: Verifying files generated by the loader

# CoreInstaller.downloadingGameAndDependencies
source: 正在下载游戏与依赖库
en: Downloading game and libraries

# CoreInstaller.downloadingGameResources
source: 正在下载游戏资源
en: Downloading game assets

# CoreInstaller.fetchingVersionManifest
source: 正在获取版本清单
en: Fetching version manifest

# CoreInstaller.installationCompleted
source: 安装完成
en: Installation complete

# CoreInstaller.installingInstance
source: 正在安装 %1$@
en: Installing %1$@

# CoreInstaller.preparingMacOSNativeLibraries
source: 正在准备 macOS 原生库
en: Preparing macOS native libraries

# CoreInstanceComponents.applyingLoaderSettings
source: 正在应用加载器设置
en: Applying loader settings

# CoreInstanceTransfer.completingPackFiles
source: 补齐整合包文件
en: Preparing modpack files

# CoreInstanceTransfer.copyingInstanceContents
source: 正在复制实例内容
en: Copying instance contents

# CoreInstanceTransfer.exportingInstance
source: 正在导出实例
en: Exporting instance

# CoreInstanceTransfer.identifyingInstance
source: 正在识别实例
en: Identifying instance

# CoreJavaInstaller.downloadJava
source: 下载 Java %1$@
en: Downloading Java %1$@

# CoreJavaInstaller.readJavaManifest
source: 读取 Java %1$@ 文件清单
en: Reading Java %1$@ file manifest

# CoreMCBBSPack.exportingMCBBSPack
source: 正在导出 MCBBS 整合包
en: Exporting MCBBS modpack

# CoreMCBBSPack.preparingPack
source: 正在准备整合包
en: Preparing modpack

# CoreMRPack.exportingPack
source: 正在导出 mrpack
en: Exporting mrpack

# CoreMRPack.identifyingFiles
source: 正在识别 Modrinth 文件来源
en: Identifying Modrinth file sources

# CoreMRPack.preparingPack
source: 正在准备整合包
en: Preparing modpack

# CoreMRPack.sourceLookupFailed
source: 无法查询文件来源，将把文件直接包含在整合包中
en: Couldn't find a download source. Including the files in the modpack.

# CoreModpackReleases.downloadingPackRelease
source: 正在下载整合包版本
en: Downloading modpack release

# CoreModpackUpdater.applyingUpdate
source: 正在应用整合包更新
en: Applying modpack update

# CoreModrinth.applyingContentUpdate
source: 正在安装资源更新
en: Applying content update

# CoreModrinthContentPlan.downloadingContent
source: 下载 %1$@
en: Downloading %1$@

# CoreOptiFineInstaller.downloadInstallPackage
source: 下载 OptiFine 安装包（BMCLAPI）
en: Downloading OptiFine installer (BMCLAPI)

# CoreOptiFineInstaller.generatePatchLibrary
source: 生成 OptiFine 补丁库
en: Generating OptiFine patch library

# CoreWorldDataPackDownloads.downloadDataPack
source: 下载 %1$@
en: Downloading %1$@

# CoreWorldDataPackDownloads.importingDataPack
source: 正在导入数据包
en: Importing data pack
